function ret = hyperplot(A)
  I1 = A(1, 1)+ A(2, 2)+ A(3, 3)
  I2 = det([A(1, 1), A(1, 2); A(1, 2) A(2, 2)])
  +det([A(2, 2), A(2, 3); A(2, 3) A(3, 3)])
  +det([A(1, 1), A(1, 3); A(1, 3) A(3, 3)])
  I3 = det(A([1:3], [1:3]))
  I4 = det(A)
  k = det([A(1, 1), A(1, 4); A(1, 4) A(4, 4)])
  l = det([A(2, 2), A(2, 4); A(2, 4) A(4, 4)])
  m = det([A(3, 3), A(3, 4); A(3, 4) A(4, 4)])
  K2 = k + l +m;
  o = det([A(1, 1), A(1, 2) A(1, 4); A(1, 2) A(2, 2) A(2, 4); A(1, 4) A(2, 4) A(4, 4)])
  p =  det([A(2, 2), A(2, 3) A(2, 4); A(2, 3) A(3, 3) A(3, 4); A(2, 4) A(3, 4) A(4, 4)])
  q = det([A(1, 1), A(1, 3) A(1, 4); A(1, 3) A(3, 3) A(3, 4); A(1, 4) A(3, 4) A(4, 4)])
  K3 = o + p + q;
  Ilambda = [-1
  (A(1, 1) + A(2, 2)+ A(3, 3))
  (-A(1, 1)*A(2, 2) -A(1, 1)*A(3, 3)- A(2, 2)* A(3, 3) + A(1, 2)* A(2, 1) + A(2, 3)*A(3, 2) + A(1, 3)* A(3, 1))
  (A(1, 1)* A(2, 2)* A(3, 3)- A(1, 2)* A(2, 1)*A(3, 3) + A(1, 2)* A(2, 3)* A(3, 1)+ A(1, 3)* A(2, 1)* A(3, 2)- A(1, 3)* A(2, 2)* A(3, 1)- A(1, 1)* A(2, 3)*A(3, 2))
  ]
  #CharEQ = [Ilambda(1), -I1* Ilambda(2),  I2* Ilambda(3),  -I3* Ilambda(4)];
  CharEQ = [1, -I1,  I2,  -I3];
  s = roots(CharEQ);
  a = s(1)
  b = s(2)
  c = s(3)
  #Проверяем, является ли поверхность однополостным гиперболоидом
  # x^2/a^2 +y^2/b^2 -z^2/c^2 =1

  if(I3 ~= 0 && I2 <=0 && I1*I3 <=0 && I4 >0)

    x = -100:1:100;
    y = -100:1:100;
    [X, Y] = meshgrid(x, y);
    Y= sqrt((-I4/I3  - (x.^2)*a)/b);
    figure;
    plot(x, Y);

    x = -100:1:100;
    y = -100:1:100;
    [X, Y] = meshgrid(x, y);
    Z = sqrt((-I4/I3  - (y.^2)*b)./c);
    figure;
    plot(y, real(Z));

    x = -100:1:100;
    y = -100:1:100;
    [X, Y] = meshgrid(x, y);
    Z = sqrt((-I4/I3 - (x.^2)*a)./c);
    figure;
    plot(x, real(Z));
  endif

  #Проверяем, является ли поверхность гиперболическим парабалоидом
  # x^2/a^2 - y^2/b^2 = 2z

  if(I3 == 0 && I4 >0)
    x = -100:1:100;
    y = -100:1:100;
    [X, Y] = meshgrid(x, y);
    X=sqrt(-(Y.^2)*(-s(2))/(-s(1)));
    figure;
    plot(X, y);

    x = -100:1:100;
    y = -100:1:100;
    [X, Y] = meshgrid(x, y);
    Z = ((x.^2)*(-s(1)))./sqrt(-I4/I2)./2;
    figure;
    plot(x, Z);

    x = -100:1:100;
    y = -100:1:100;
    [X, Y] = meshgrid(x, y);
    Z = ((y.^2)*(-s(2)))./sqrt(-I4/I2)./2;
    figure;
    plot(y, Z);
  endif





endfunction

