function ret = ishyper(A)
  ret = false;
  I1 = A(1, 1)+ A(2, 2)+ A(3, 3);
  I2 = det([A(1, 1), A(1, 2); A(1, 2) A(2, 2)]);
  +det([A(2, 2), A(2, 3); A(2, 3) A(3, 3)]);
  +det([A(1, 1), A(1, 3); A(1, 3) A(3, 3)]);
  I3 = det(A([1:3], [1:3]));
  I4 = det(A);

  #Ilambda = [-1;
  #(A(1, 1) + A(2, 2)+ A(3, 3));
  #(-A(1, 1)*A(2, 2) - A(2, 2)* A(3, 3) + A(1, 2)* A(2, 1) + A(1, 3)* A(3, 1));
  #(A(1, 1)* A(2, 2)* A(3, 3)- A(1, 2)* A(2, 1)*A(3, 3) + A(1, 2)* A(2, 3)* A(3, 1)+ A(1, 3)* A(2, 1)* A(3, 2)- A(1, 3)* A(2, 2)* A(3, 1))
  #]

  K2 = det([A(1, 1), A(1, 4); A(1, 4) A(4, 4)]);
  +det([A(2, 2), A(2, 4); A(2, 4) A(4, 4)]);
  +det([A(3, 3), A(3, 4); A(3, 4) A(4, 4)]);
  K3 = det([A(1, 1), A(1, 2) A(1, 4); A(1, 2) A(2, 2) A(2, 4); A(1, 4) A(2, 4) A(4, 4)]);
  + det([A(2, 2), A(2, 3) A(2, 4); A(2, 3) A(3, 3) A(3, 4); A(2, 4) A(3, 4) A(4, 4)]);
  + det([A(1, 1), A(1, 3) A(1, 4); A(1, 3) A(3, 3) A(3, 4); A(1, 4) A(3, 4) A(4, 4)]);

  #CharEQ = [Ilambda(1, 1), -I1* ILambda(1, 2),  I2* ILambda(1, 3),  -I3* ILambda(1, 4)];
  #s = roots(CharEQ);



  #Проверяем, является ли поверхность однополостным гиперболоидом
  # x^2/a^2 +y^2/b^2 -z^2/c^2 =1

  if(I3 != 0 && I2 <=0 && I1*I3 <=0 && I4 >0)
    ret = true;
  endif

  #Проверяем, является ли поверхность гиперболическим парабалоидом
  # x^2/a^2 - y^2/b^2 = 2z

  if(I3 == 0 && I4 >0)
    ret = true;
  endif

endfunction
